import pandas as pd
import datetime as dt
a = '''सुनिता डावर 9836 3636  70
सुलोचना कड़ेल 90621 02122
बबीता बराडिया 98 301 12 26 6
 अंकिता   तोसावड़ 84200 20 133
 सरोज तोसावड़ 98 3170 4885
 सुशीला  तोषावड  933 9435 182
सावित्री  ढल्ला 98 30 60 82 89
 पिंकी कुलथिया 98 04  97 4011
कलावती कड़ेल 900 72 83 630
 निर्मला देवी सोनी 933 95 64 885
 हीरा  देवी तोसावड़ 900 797 2792
  रोमा सिरसीवाल 933 09 12729
 संजू सुगंध 933  04 97  7 7 3
 मधु गोस्वामी 97 48   55 13 26
 अलका कुलथिया 90 51 8 77  4  66
 जया बर्मा 933 10 44 074
  लक्ष्मी कड़ेल 900 79 72 702
 यशोदा कुलथिया 933 01 1 61 64
 मंजू कड़ेल   88  20 91 43 84
 कौशल्या कड़ेल 91 23 36 84 43
 सरस्वती नारनौली 98 30 87 80 37
 सरस्वती सोनी 98 74 73 2135
सुशीला तोसावड  933 181 297 8
 सीमा तोसावड 89 106 25 851
 संतोष तोसावड  933 925 18 99
 वंदना तोसावड 98 3679 4590
मैनादेवी सोनी  900 70 90 02 0
  रेणुका   रोडा 801 701 63 06
मनीषा कुलथिया 98 74 825 08 8
 ज्योति मौसूण 98 74 73 21 35
 चंदा सुगंध 88 20 66 35  36
 मंजू सोनी डावर 85 8303 72 57
मंजू रोड़ा  933 128 62 99
 नीलम डावर  86 97 20 84 44
चंद्रकला डावर 8583 03 72 57
 सीमा  तोसावड 89  106 25 851
 सुशीला तोसावड़  933 181 29 78'''

dummyFile = pd.read_csv('contacts.csv')

a = a.replace(" ","").split("\n")
contacts = []
for each in a:
    phn = each[::-1][:10][::-1]
    names = each.split(str(phn))[0]
    contacts.append([names,phn])

df =  pd.DataFrame(contacts)
# df = df.transpose()
df.columns = ["Name" , "Phone"]
# print(df)
fileName = 'new_contact' + str((int(dt.datetime.now().microsecond) * 999)) + '.csv'
# fileName = 'new_contact' + str(dt.datetime.now().strftime('%Y-%m-%d %H:%M:%S')) + '.csv'
df.to_csv(fileName,sep="\t",encoding="utf-32" , index=False)